Revit 2026 API

# ElementIdParameterValue(ElementId) Constructor

---

Value constructor

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementIdParameterValue(
	ElementId value
)
```
```vb
Public Sub New (
	value As ElementId
)
```
```cpp
public:
ElementIdParameterValue(
	ElementId^ value
)
```
```fsharp
new :
        value : ElementId -> ElementIdParameterValue
```

#### Parameters

value ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ElementIdParameterValue Class

ElementIdParameterValue Overload

Autodesk.Revit.DB Namespace